Repository: Yvonne-Wanja-1/agrinew
Catalog: lib/l10n/app_*.arb
Languages: sw

# appDescription
source: Smart Farming Assistant
sw: Msaada wa Smart Farming

# welcome
source: Welcome to Agri Clinic Hub
sw: Karibu kwenye Agri Clinic Hub

source: Get Started
sw: Anza

source: Login
sw: Ingia

source: Sign Up
sw: Jandikisha

# email
source: Email Address
sw: Barua pepe

source: Password
sw: Nenosiri

source: Full Name
sw: Jina Kamili

# phone
source: Phone Number
sw: Namba ya Simu

source: County
sw: Kaunti

# farmSize
source: Farm Size (acres)
sw: Ukubwa wa Shambani (ekari)

source: Crop Types
sw: Aina za Mazao

source: Livestock Types
sw: Aina za Mifugo

source: Forgot Password?
sw: Umesahau Nenosiri?

source: Remember Me
sw: Nikumbuke

# signupNow
source: Don't have an account? Sign Up
sw: Huna akaunti? Jandikisha

# loginNow
source: Already have an account? Login
sw: Una akaunti? Ingia

source: Logout
sw: Toka

source: Home
sw: Nyumbani

# scan
source: Scan Plant
sw: Changanua Mmea

# history
source: Scan History
sw: Historia ya Uchunguzi

source: Profile
sw: Profaili

source: Settings
sw: Mipangilio

# education
source: Learn
sw: Jifunze

source: Calendar
sw: Kalenda

source: Upload Image
sw: Pakia Picha

source: Take Photo
sw: Chukua Picha

source: Disease Detected
sw: Ugonjwa Umegunduliwa

# healthyPlant
source: Plant appears healthy
sw: Mmea unaonekana salama

source: Recommendations
sw: Mapendekezo

# treatment
source: Treatment Options
sw: Chaguo za Matibabu

# prevention
source: Prevention Tips
sw: Vidokezo vya Kuzuia

source: Scan Results
sw: Matokeo ya Uchunguzi

# resultDate
source: Scan Date
sw: Tarehe ya Uchunguzi

# resultCrop
source: Crop Type
sw: Aina ya Mmea

# resultDisease
source: Disease Found
sw: Ugonjwa Uliopatikana

# resultConfidence
source: Confidence
sw: Uhakika

source: View Full Report
sw: Angalia Ripoti Kamili

# shareScan
source: Share Results
sw: Sambaza Matokeo

# deleteScan
source: Delete
sw: Futa

# noScans
source: No scans yet
sw: Hakuna uchunguzi bado

# startScanning
source: Start Scanning Plants
sw: Anza Kuchunguza Miti

# selectCounty
source: Select Your County
sw: Chagua Kaunti Yako

source: Crop Calendar
sw: Kalenda ya Mazao

source: Planting Time
sw: Wakati wa Kupanda

source: Harvest Time
sw: Wakati wa Kunong'oneza

source: Seasonal Tips
sw: Vidokezo vya Msimu

source: Articles
sw: Makala

source: Videos
sw: Video

source: Guides
sw: Mwongozo

source: Expert Advice
sw: Ushauri wa Mtaalamu

source: Voice Mode
sw: Njia ya Sauti

source: Start Listening
sw: Anza Kusikiliza

source: Stop Listening
sw: Acha Kusikiliza

# speak
source: Speak Now
sw: Sema Sasa

# offline
source: Offline Mode
sw: Hali Bila Mtandao

source: Syncing...
sw: Inasambaza...

source: Error
sw: Hitilafu

source: Success
sw: Mafanikio

source: Retry
sw: Jaribu Tena

source: Cancel
sw: Ghairi

source: Save
sw: Hifadhi

source: Update
sw: Sasisha

source: Delete
sw: Futa

source: Confirm
sw: Thibitisha

# confirmDelete
source: Are you sure you want to delete?
sw: Je, una hakika unataka kufuta?

source: Language
sw: Lugha

# notification
source: Notifications
sw: Arifa

source: About
sw: Kuhusu

source: Privacy Policy
sw: Sera ya Faragha

source: Terms of Service
sw: Sheria za Huduma

source: Contact Us
sw: Wasiliana Nasi

source: Farmer Profile
sw: Profaili ya Mkulima

source: Edit Profile
sw: Hariri Profaili

source: Farm Details
sw: Maelezo ya Shambani

source: Previous Scans
sw: Uchunguzi wa Hapo Awali

source: Treatment History
sw: Historia ya Matibabu

source: Saving profile...
sw: Inakuhifadhi profaili...

# profileUpdated
source: Profile updated successfully
sw: Profaili ilisasishwa kwa mafanikio

source: Loading scans...
sw: Inakuongeza uchunguzi...

# noInternet
source: No internet connection
sw: Hakuna muunganisho wa Mtandao

source: Using offline data
sw: Inatumia data ya Offline

# syncWhenOnline
source: Data will sync when online
sw: Data itasambazwa wakati mtandao upo

source: Select Image
sw: Chagua Picha

source: Processing...
sw: Inaprosesa...

# analyzing
source: Analyzing image...
sw: Inachambua picha...

source: Please wait
sw: Tafadhali subiri

# somethingWrong
source: Something went wrong
sw: Kitu kimefeli

source: Try again
sw: Jaribu tena

source: Crop Varieties
sw: Aina za Mazao

source: Soil Condition
sw: Hali ya Udongo

source: Weather Forecast
sw: Haba za Hewa

source: Market Prices
sw: Bei za Soko

source: Pest Management
sw: Usimamizi wa Wadudu

source: Livestock Health
sw: Afya ya Mifugo

source: All Counties
sw: Kaunti Zote
